espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_letimer.h
/* Bit fields for LETIMER STATUS */
#define _LETIMER_STATUS_RESETVALUE               0x00000000UL                           /**< Default value for LETIMER_STATUS            */
#define _LETIMER_STATUS_MASK                     0x00000001UL                           /**< Mask for LETIMER_STATUS                     */
#define LETIMER_STATUS_RUNNING                   (0x1UL << 0)                           /**< LETIMER Running                             */
#define _LETIMER_STATUS_RUNNING_SHIFT            0                                      /**< Shift value for LETIMER_RUNNING             */
#define _LETIMER_STATUS_RUNNING_MASK             0x1UL                                  /**< Bit mask for LETIMER_RUNNING                */
#define _LETIMER_STATUS_RUNNING_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for LETIMER_STATUS             */
#define LETIMER_STATUS_RUNNING_DEFAULT           (_LETIMER_STATUS_RUNNING_DEFAULT << 0) /**< Shifted mode DEFAULT for LETIMER_STATUS     */

/* Bit fields for LETIMER CNT */
#define _LETIMER_CNT_RESETVALUE                  0x00000000UL                           /**< Default value for LETIMER_CNT               */
#define _LETIMER_CNT_MASK                        0x00FFFFFFUL                           /**< Mask for LETIMER_CNT                        */
#define _LETIMER_CNT_CNT_SHIFT                   0                                      /**< Shift value for LETIMER_CNT                 */
#define _LETIMER_CNT_CNT_MASK                    0xFFFFFFUL                             /**< Bit mask for LETIMER_CNT                    */
#define _LETIMER_CNT_CNT_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for LETIMER_CNT                */
#define LETIMER_CNT_CNT_DEFAULT                  (_LETIMER_CNT_CNT_DEFAULT << 0)        /**< Shifted mode DEFAULT for LETIMER_CNT        */

/* Bit fields for LETIMER COMP0 */
#define _LETIMER_COMP0_RESETVALUE                0x00000000UL                           /**< Default value for LETIMER_COMP0             */
#define _LETIMER_COMP0_MASK                      0x00FFFFFFUL                           /**< Mask for LETIMER_COMP0                      */
#define _LETIMER_COMP0_COMP0_SHIFT               0                                      /**< Shift value for LETIMER_COMP0               */
#define _LETIMER_COMP0_COMP0_MASK                0xFFFFFFUL                             /**< Bit mask for LETIMER_COMP0                  */
#define _LETIMER_COMP0_COMP0_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for LETIMER_COMP0              */
#define LETIMER_COMP0_COMP0_DEFAULT              (_LETIMER_COMP0_COMP0_DEFAULT << 0)    /**< Shifted mode DEFAULT for LETIMER_COMP0      */

/* Bit fields for LETIMER COMP1 */
#define _LETIMER_COMP1_RESETVALUE                0x00000000UL                           /**< Default value for LETIMER_COMP1             */
#define _LETIMER_COMP1_MASK                      0x00FFFFFFUL                           /**< Mask for LETIMER_COMP1                      */
#define _LETIMER_COMP1_COMP1_SHIFT               0                                      /**< Shift value for LETIMER_COMP1               */
#define _LETIMER_COMP1_COMP1_MASK                0xFFFFFFUL                             /**< Bit mask for LETIMER_COMP1                  */
#define _LETIMER_COMP1_COMP1_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for LETIMER_COMP1              */
#define LETIMER_COMP1_COMP1_DEFAULT              (_LETIMER_COMP1_COMP1_DEFAULT << 0)    /**< Shifted mode DEFAULT for LETIMER_COMP1      */

/* Bit fields for LETIMER TOP */
#define _LETIMER_TOP_RESETVALUE                  0x00000000UL                           /**< Default value for LETIMER_TOP               */
#define _LETIMER_TOP_MASK                        0x00FFFFFFUL                           /**< Mask for LETIMER_TOP                        */
#define _LETIMER_TOP_TOP_SHIFT                   0                                      /**< Shift value for LETIMER_TOP                 */
#define _LETIMER_TOP_TOP_MASK                    0xFFFFFFUL                             /**< Bit mask for LETIMER_TOP                    */
#define _LETIMER_TOP_TOP_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for LETIMER_TOP                */
#define LETIMER_TOP_TOP_DEFAULT                  (_LETIMER_TOP_TOP_DEFAULT << 0)        /**< Shifted mode DEFAULT for LETIMER_TOP        */

/* Bit fields for LETIMER TOPBUFF */
#define _LETIMER_TOPBUFF_RESETVALUE              0x00000000UL                            /**< Default value for LETIMER_TOPBUFF           */
#define _LETIMER_TOPBUFF_MASK                    0x00FFFFFFUL                            /**< Mask for LETIMER_TOPBUFF                    */
#define _LETIMER_TOPBUFF_TOPBUFF_SHIFT           0                                       /**< Shift value for LETIMER_TOPBUFF             */
#define _LETIMER_TOPBUFF_TOPBUFF_MASK            0xFFFFFFUL                              /**< Bit mask for LETIMER_TOPBUFF                */
#define _LETIMER_TOPBUFF_TOPBUFF_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LETIMER_TOPBUFF            */
#define LETIMER_TOPBUFF_TOPBUFF_DEFAULT          (_LETIMER_TOPBUFF_TOPBUFF_DEFAULT << 0) /**< Shifted mode DEFAULT for LETIMER_TOPBUFF    */

/* Bit fields for LETIMER REP0 */
#define _LETIMER_REP0_RESETVALUE                 0x00000000UL                           /**< Default value for LETIMER_REP0              */
#define _LETIMER_REP0_MASK                       0x000000FFUL                           /**< Mask for LETIMER_REP0                       */
#define _LETIMER_REP0_REP0_SHIFT                 0                                      /**< Shift value for LETIMER_REP0                */
#define _LETIMER_REP0_REP0_MASK                  0xFFUL                                 /**< Bit mask for LETIMER_REP0                   */
#define _LETIMER_REP0_REP0_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for LETIMER_REP0               */
#define LETIMER_REP0_REP0_DEFAULT                (_LETIMER_REP0_REP0_DEFAULT << 0)      /**< Shifted mode DEFAULT for LETIMER_REP0       */

/* Bit fields for LETIMER REP1 */
#define _LETIMER_REP1_RESETVALUE                 0x00000000UL                           /**< Default value for LETIMER_REP1              */
#define _LETIMER_REP1_MASK                       0x000000FFUL                           /**< Mask for LETIMER_REP1                       */
#define _LETIMER_REP1_REP1_SHIFT                 0                                      /**< Shift value for LETIMER_REP1                */
#define _LETIMER_REP1_REP1_MASK                  0xFFUL                                 /**< Bit mask for LETIMER_REP1                   */
#define _LETIMER_REP1_REP1_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for LETIMER_REP1               */
#define LETIMER_REP1_REP1_DEFAULT                (_LETIMER_REP1_REP1_DEFAULT << 0)      /**< Shifted mode DEFAULT for LETIMER_REP1       */

/* Bit fields for LETIMER IF */
#define _LETIMER_IF_RESETVALUE                   0x00000000UL                           /**< Default value for LETIMER_IF                */
#define _LETIMER_IF_MASK                         0x0000001FUL                           /**< Mask for LETIMER_IF                         */
#define LETIMER_IF_COMP0                         (0x1UL << 0)                           /**< Compare Match 0 Interrupt Flag              */
#define _LETIMER_IF_COMP0_SHIFT                  0                                      /**< Shift value for LETIMER_COMP0               */
#define _LETIMER_IF_COMP0_MASK                   0x1UL                                  /**< Bit mask for LETIMER_COMP0                  */
#define _LETIMER_IF_COMP0_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_COMP0_DEFAULT                 (_LETIMER_IF_COMP0_DEFAULT << 0)       /**< Shifted mode DEFAULT for LETIMER_IF         */
#define LETIMER_IF_COMP1                         (0x1UL << 1)                           /**< Compare Match 1 Interrupt Flag              */
#define _LETIMER_IF_COMP1_SHIFT                  1                                      /**< Shift value for LETIMER_COMP1               */
#define _LETIMER_IF_COMP1_MASK                   0x2UL                                  /**< Bit mask for LETIMER_COMP1                  */
#define _LETIMER_IF_COMP1_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_COMP1_DEFAULT                 (_LETIMER_IF_COMP1_DEFAULT << 1)       /**< Shifted mode DEFAULT for LETIMER_IF         */
#define LETIMER_IF_UF                            (0x1UL << 2)                           /**< Underflow Interrupt Flag                    */
#define _LETIMER_IF_UF_SHIFT                     2                                      /**< Shift value for LETIMER_UF                  */
#define _LETIMER_IF_UF_MASK                      0x4UL                                  /**< Bit mask for LETIMER_UF                     */
#define _LETIMER_IF_UF_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_UF_DEFAULT                    (_LETIMER_IF_UF_DEFAULT << 2)          /**< Shifted mode DEFAULT for LETIMER_IF         */
#define LETIMER_IF_REP0                          (0x1UL << 3)                           /**< Repeat Counter 0 Interrupt Flag             */
#define _LETIMER_IF_REP0_SHIFT                   3                                      /**< Shift value for LETIMER_REP0                */
#define _LETIMER_IF_REP0_MASK                    0x8UL                                  /**< Bit mask for LETIMER_REP0                   */
#define _LETIMER_IF_REP0_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_REP0_DEFAULT                  (_LETIMER_IF_REP0_DEFAULT << 3)        /**< Shifted mode DEFAULT for LETIMER_IF         */
#define LETIMER_IF_REP1                          (0x1UL << 4)                           /**< Repeat Counter 1 Interrupt Flag             */
#define _LETIMER_IF_REP1_SHIFT                   4                                      /**< Shift value for LETIMER_REP1                */
#define _LETIMER_IF_REP1_MASK                    0x10UL                                 /**< Bit mask for LETIMER_REP1                   */
#define _LETIMER_IF_REP1_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_REP1_DEFAULT                  (_LETIMER_IF_REP1_DEFAULT << 4)        /**< Shifted mode DEFAULT for LETIMER_IF         */

/* Bit fields for LETIMER IEN */
#define _LETIMER_IEN_RESETVALUE                  0x00000000UL                           /**< Default value for LETIMER_IEN               */
#define _LETIMER_IEN_MASK                        0x0000001FUL                           /**< Mask for LETIMER_IEN                        */
#define LETIMER_IEN_COMP0                        (0x1UL << 0)                           /**< Compare Match 0 Interrupt Enable            */
#define _LETIMER_IEN_COMP0_SHIFT                 0                                      /**< Shift value for LETIMER_COMP0               */
#define _LETIMER_IEN_COMP0_MASK                  0x1UL                                  /**< Bit mask for LETIMER_COMP0                  */
#define _LETIMER_IEN_COMP0_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_COMP0_DEFAULT                (_LETIMER_IEN_COMP0_DEFAULT << 0)      /**< Shifted mode DEFAULT for LETIMER_IEN        */
#define LETIMER_IEN_COMP1                        (0x1UL << 1)                           /**< Compare Match 1 Interrupt Enable            */
#define _LETIMER_IEN_COMP1_SHIFT                 1                                      /**< Shift value for LETIMER_COMP1               */
#define _LETIMER_IEN_COMP1_MASK                  0x2UL                                  /**< Bit mask for LETIMER_COMP1                  */
#define _LETIMER_IEN_COMP1_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_COMP1_DEFAULT                (_LETIMER_IEN_COMP1_DEFAULT << 1)      /**< Shifted mode DEFAULT for LETIMER_IEN        */
#define LETIMER_IEN_UF                           (0x1UL << 2)                           /**< Underflow Interrupt Enable                  */
#define _LETIMER_IEN_UF_SHIFT                    2                                      /**< Shift value for LETIMER_UF                  */
#define _LETIMER_IEN_UF_MASK                     0x4UL                                  /**< Bit mask for LETIMER_UF                     */
#define _LETIMER_IEN_UF_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_UF_DEFAULT                   (_LETIMER_IEN_UF_DEFAULT << 2)         /**< Shifted mode DEFAULT for LETIMER_IEN        */
#define LETIMER_IEN_REP0                         (0x1UL << 3)                           /**< Repeat Counter 0 Interrupt Enable           */
#define _LETIMER_IEN_REP0_SHIFT                  3                                      /**< Shift value for LETIMER_REP0                */
#define _LETIMER_IEN_REP0_MASK                   0x8UL                                  /**< Bit mask for LETIMER_REP0                   */
#define _LETIMER_IEN_REP0_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_REP0_DEFAULT                 (_LETIMER_IEN_REP0_DEFAULT << 3)       /**< Shifted mode DEFAULT for LETIMER_IEN        */
#define LETIMER_IEN_REP1                         (0x1UL << 4)                           /**< Repeat Counter 1 Interrupt Enable           */
#define _LETIMER_IEN_REP1_SHIFT                  4                                      /**< Shift value for LETIMER_REP1                */
#define _LETIMER_IEN_REP1_MASK                   0x10UL                                 /**< Bit mask for LETIMER_REP1                   */
#define _LETIMER_IEN_REP1_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_REP1_DEFAULT                 (_LETIMER_IEN_REP1_DEFAULT << 4)       /**< Shifted mode DEFAULT for LETIMER_IEN        */

/* Bit fields for LETIMER SYNCBUSY */
#define _LETIMER_SYNCBUSY_RESETVALUE             0x00000000UL                           /**< Default value for LETIMER_SYNCBUSY          */
#define _LETIMER_SYNCBUSY_MASK                   0x000003FDUL                           /**< Mask for LETIMER_SYNCBUSY                   */
#define LETIMER_SYNCBUSY_CNT                     (0x1UL << 0)                           /**< Sync busy for CNT                           */
#define _LETIMER_SYNCBUSY_CNT_SHIFT              0                                      /**< Shift value for LETIMER_CNT                 */
#define _LETIMER_SYNCBUSY_CNT_MASK               0x1UL                                  /**< Bit mask for LETIMER_CNT                    */
#define _LETIMER_SYNCBUSY_CNT_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_CNT_DEFAULT             (_LETIMER_SYNCBUSY_CNT_DEFAULT << 0)   /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_TOP                     (0x1UL << 2)                           /**< Sync busy for TOP                           */
#define _LETIMER_SYNCBUSY_TOP_SHIFT              2                                      /**< Shift value for LETIMER_TOP                 */
#define _LETIMER_SYNCBUSY_TOP_MASK               0x4UL                                  /**< Bit mask for LETIMER_TOP                    */
#define _LETIMER_SYNCBUSY_TOP_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_TOP_DEFAULT             (_LETIMER_SYNCBUSY_TOP_DEFAULT << 2)   /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_REP0                    (0x1UL << 3)                           /**< Sync busy for REP0                          */
#define _LETIMER_SYNCBUSY_REP0_SHIFT             3                                      /**< Shift value for LETIMER_REP0                */
#define _LETIMER_SYNCBUSY_REP0_MASK              0x8UL                                  /**< Bit mask for LETIMER_REP0                   */
#define _LETIMER_SYNCBUSY_REP0_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_REP0_DEFAULT            (_LETIMER_SYNCBUSY_REP0_DEFAULT << 3)  /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_REP1                    (0x1UL << 4)                           /**< Sync busy for REP1                          */
#define _LETIMER_SYNCBUSY_REP1_SHIFT             4                                      /**< Shift value for LETIMER_REP1                */
#define _LETIMER_SYNCBUSY_REP1_MASK              0x10UL                                 /**< Bit mask for LETIMER_REP1                   */
#define _LETIMER_SYNCBUSY_REP1_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_REP1_DEFAULT            (_LETIMER_SYNCBUSY_REP1_DEFAULT << 4)  /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_START                   (0x1UL << 5)                           /**< Sync busy for START                         */
#define _LETIMER_SYNCBUSY_START_SHIFT            5                                      /**< Shift value for LETIMER_START               */
#define _LETIMER_SYNCBUSY_START_MASK             0x20UL                                 /**< Bit mask for LETIMER_START                  */
#define _LETIMER_SYNCBUSY_START_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_START_DEFAULT           (_LETIMER_SYNCBUSY_START_DEFAULT << 5) /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_STOP                    (0x1UL << 6)                           /**< Sync busy for STOP                          */
#define _LETIMER_SYNCBUSY_STOP_SHIFT             6                                      /**< Shift value for LETIMER_STOP                */
#define _LETIMER_SYNCBUSY_STOP_MASK              0x40UL                                 /**< Bit mask for LETIMER_STOP                   */
#define _LETIMER_SYNCBUSY_STOP_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_STOP_DEFAULT            (_LETIMER_SYNCBUSY_STOP_DEFAULT << 6)  /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_CLEAR                   (0x1UL << 7)                           /**< Sync busy for CLEAR                         */
#define _LETIMER_SYNCBUSY_CLEAR_SHIFT            7                                      /**< Shift value for LETIMER_CLEAR               */
#define _LETIMER_SYNCBUSY_CLEAR_MASK             0x80UL                                 /**< Bit mask for LETIMER_CLEAR                  */
#define _LETIMER_SYNCBUSY_CLEAR_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_CLEAR_DEFAULT           (_LETIMER_SYNCBUSY_CLEAR_DEFAULT << 7) /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_CTO0                    (0x1UL << 8)                           /**< Sync busy for CTO0                          */
#define _LETIMER_SYNCBUSY_CTO0_SHIFT             8                                      /**< Shift value for LETIMER_CTO0                */
#define _LETIMER_SYNCBUSY_CTO0_MASK              0x100UL                                /**< Bit mask for LETIMER_CTO0                   */
#define _LETIMER_SYNCBUSY_CTO0_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_CTO0_DEFAULT            (_LETIMER_SYNCBUSY_CTO0_DEFAULT << 8)  /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_CTO1                    (0x1UL << 9)                           /**< Sync busy for CTO1                          */
#define _LETIMER_SYNCBUSY_CTO1_SHIFT             9                                      /**< Shift value for LETIMER_CTO1                */
#define _LETIMER_SYNCBUSY_CTO1_MASK              0x200UL                                /**< Bit mask for LETIMER_CTO1                   */
#define _LETIMER_SYNCBUSY_CTO1_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_CTO1_DEFAULT            (_LETIMER_SYNCBUSY_CTO1_DEFAULT << 9)  /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */

